ProgramNode(465...12823)(
  ScopeNode(0...0)([]),
  StatementsNode(465...12823)(
    [InterpolatedStringNode(465...501)(
       HEREDOC_START(455...464)("<<SPECIAL"),
       [StringNode(465...501)(
          nil,
          STRING_CONTENT(465...501)(
            ",./;'[]\\-=\n" + "<>?:\\\"{}|_+\n" + "!@\#$%^&*()`~\n"
          ),
          nil,
          ",./;'[]-=\n" + "<>?:\"{}|_+\n" + "!@\#$%^&*()`~\n"
        )],
       HEREDOC_END(501...509)("SPECIAL\n")
     ),
     StringNode(840...869)(
       STRING_BEGIN(840...841)("\""),
       STRING_CONTENT(841...868)(
         "\u0001\u0002\u0003\u0004\u0005\u0006\a\b\u000E\u000F\u0010\u0011\u0012\u0013\u0014\u0015\u0016\u0017\u0018\u0019\u001A\e\u001C\u001D\u001E\u001F\u007F"
       ),
       STRING_END(868...869)("\""),
       "\u0001\u0002\u0003\u0004\u0005\u0006\a\b\u000E\u000F\u0010\u0011\u0012\u0013\u0014\u0015\u0016\u0017\u0018\u0019\u001A\e\u001C\u001D\u001E\u001F\u007F"
     ),
     StringNode(1089...1153)(
       STRING_BEGIN(1089...1090)("\""),
       STRING_CONTENT(1090...1152)(
         "\u0080\u0081\u0082\u0083\u0084\u0086\u0087\u0088\u0089\u008A\u008B\u008C\u008D\u008E\u008F\u0090\u0091\u0092\u0093\u0094\u0095\u0096\u0097\u0098\u0099\u009A\u009B\u009C\u009D\u009E\u009F"
       ),
       STRING_END(1152...1153)("\""),
       "\u0080\u0081\u0082\u0083\u0084\u0086\u0087\u0088\u0089\u008A\u008B\u008C\u008D\u008E\u008F\u0090\u0091\u0092\u0093\u0094\u0095\u0096\u0097\u0098\u0099\u009A\u009B\u009C\u009D\u009E\u009F"
     ),
     StringNode(1671...1734)(
       STRING_BEGIN(1671...1672)("\""),
       STRING_CONTENT(1672...1733)(
         "\t\v\f \u0085             ​\u2028\u2029  　"
       ),
       STRING_END(1733...1734)("\""),
       "\t\v\f \u0085             ​\u2028\u2029  　"
     ),
     StringNode(1914...2466)(
       STRING_BEGIN(1914...1915)("\""),
       STRING_CONTENT(1915...2465)(
         "­؀؁؂؃؄؅؜۝܏᠎​‌‍‎‏‪‫‬‭‮⁠⁡⁢⁣⁤⁦⁧⁨⁩⁪⁫⁬⁭⁮⁯﻿￹￺￻𑂽𛲠𛲡𛲢𛲣𝅳𝅴𝅵𝅶𝅷𝅸𝅹𝅺󠀁󠀠󠀡󠀢󠀣󠀤󠀥󠀦󠀧󠀨󠀩󠀪󠀫󠀬󠀭󠀮󠀯󠀰󠀱󠀲󠀳󠀴󠀵󠀶󠀷󠀸󠀹󠀺󠀻󠀼󠀽󠀾󠀿󠁀󠁁󠁂󠁃󠁄󠁅󠁆󠁇󠁈󠁉󠁊󠁋󠁌󠁍󠁎󠁏󠁐󠁑󠁒󠁓󠁔󠁕󠁖󠁗󠁘󠁙󠁚󠁛󠁜󠁝󠁞󠁟󠁠󠁡󠁢󠁣󠁤󠁥󠁦󠁧󠁨󠁩󠁪󠁫󠁬󠁭󠁮󠁯󠁰󠁱󠁲󠁳󠁴󠁵󠁶󠁷󠁸󠁹󠁺󠁻󠁼󠁽󠁾󠁿"
       ),
       STRING_END(2465...2466)("\""),
       "­؀؁؂؃؄؅؜۝܏᠎​‌‍‎‏‪‫‬‭‮⁠⁡⁢⁣⁤⁦⁧⁨⁩⁪⁫⁬⁭⁮⁯﻿￹￺￻𑂽𛲠𛲡𛲢𛲣𝅳𝅴𝅵𝅶𝅷𝅸𝅹𝅺󠀁󠀠󠀡󠀢󠀣󠀤󠀥󠀦󠀧󠀨󠀩󠀪󠀫󠀬󠀭󠀮󠀯󠀰󠀱󠀲󠀳󠀴󠀵󠀶󠀷󠀸󠀹󠀺󠀻󠀼󠀽󠀾󠀿󠁀󠁁󠁂󠁃󠁄󠁅󠁆󠁇󠁈󠁉󠁊󠁋󠁌󠁍󠁎󠁏󠁐󠁑󠁒󠁓󠁔󠁕󠁖󠁗󠁘󠁙󠁚󠁛󠁜󠁝󠁞󠁟󠁠󠁡󠁢󠁣󠁤󠁥󠁦󠁧󠁨󠁩󠁪󠁫󠁬󠁭󠁮󠁯󠁰󠁱󠁲󠁳󠁴󠁵󠁶󠁷󠁸󠁹󠁺󠁻󠁼󠁽󠁾󠁿"
     ),
     CallNode(2604...2607)(
       nil,
       nil,
       IDENTIFIER(2604...2607)("﻿"),
       nil,
       nil,
       nil,
       nil,
       "﻿"
     ),
     StringNode(2608...2613)(
       STRING_BEGIN(2608...2609)("\""),
       STRING_CONTENT(2609...2612)("\uFFFE"),
       STRING_END(2612...2613)("\""),
       "\uFFFE"
     ),
     StringNode(2703...2730)(
       STRING_BEGIN(2703...2704)("\""),
       STRING_CONTENT(2704...2729)("Ω≈ç√∫˜µ≤≥÷"),
       STRING_END(2729...2730)("\""),
       "Ω≈ç√∫˜µ≤≥÷"
     ),
     StringNode(2731...2758)(
       STRING_BEGIN(2731...2732)("\""),
       STRING_CONTENT(2732...2757)("åß∂ƒ©˙∆˚¬…æ"),
       STRING_END(2757...2758)("\""),
       "åß∂ƒ©˙∆˚¬…æ"
     ),
     StringNode(2759...2789)(
       STRING_BEGIN(2759...2760)("\""),
       STRING_CONTENT(2760...2788)("œ∑´®†¥¨ˆøπ“‘"),
       STRING_END(2788...2789)("\""),
       "œ∑´®†¥¨ˆøπ“‘"
     ),
     StringNode(2790...2821)(
       STRING_BEGIN(2790...2791)("\""),
       STRING_CONTENT(2791...2820)("¡™£¢∞§¶•ªº–≠"),
       STRING_END(2820...2821)("\""),
       "¡™£¢∞§¶•ªº–≠"
     ),
     StringNode(2822...2845)(
       STRING_BEGIN(2822...2823)("\""),
       STRING_CONTENT(2823...2844)("¸˛Ç◊ı˜Â¯˘¿"),
       STRING_END(2844...2845)("\""),
       "¸˛Ç◊ı˜Â¯˘¿"
     ),
     StringNode(2846...2874)(
       STRING_BEGIN(2846...2847)("\""),
       STRING_CONTENT(2847...2873)("ÅÍÎÏ˝ÓÔÒÚÆ☃"),
       STRING_END(2873...2874)("\""),
       "ÅÍÎÏ˝ÓÔÒÚÆ☃"
     ),
     StringNode(2875...2906)(
       STRING_BEGIN(2875...2876)("\""),
       STRING_CONTENT(2876...2905)("Œ„´‰ˇÁ¨ˆØ∏”’"),
       STRING_END(2905...2906)("\""),
       "Œ„´‰ˇÁ¨ˆØ∏”’"
     ),
     StringNode(2907...2943)(
       STRING_BEGIN(2907...2908)("\""),
       STRING_CONTENT(2908...2942)("`⁄€‹›ﬁﬂ‡°·‚—±"),
       STRING_END(2942...2943)("\""),
       "`⁄€‹›ﬁﬂ‡°·‚—±"
     ),
     StringNode(2944...2958)(
       STRING_BEGIN(2944...2945)("\""),
       STRING_CONTENT(2945...2957)("⅛⅜⅝⅞"),
       STRING_END(2957...2958)("\""),
       "⅛⅜⅝⅞"
     ),
     StringNode(2959...3119)(
       STRING_BEGIN(2959...2960)("\""),
       STRING_CONTENT(2960...3118)(
         "ЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюя"
       ),
       STRING_END(3118...3119)("\""),
       "ЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюя"
     ),
     StringNode(3120...3142)(
       STRING_BEGIN(3120...3121)("\""),
       STRING_CONTENT(3121...3141)("٠١٢٣٤٥٦٧٨٩"),
       STRING_END(3141...3142)("\""),
       "٠١٢٣٤٥٦٧٨٩"
     ),
     StringNode(3271...3282)(
       STRING_BEGIN(3271...3272)("\""),
       STRING_CONTENT(3272...3281)("⁰⁴⁵"),
       STRING_END(3281...3282)("\""),
       "⁰⁴⁵"
     ),
     StringNode(3283...3294)(
       STRING_BEGIN(3283...3284)("\""),
       STRING_CONTENT(3284...3293)("₀₁₂"),
       STRING_END(3293...3294)("\""),
       "₀₁₂"
     ),
     StringNode(3295...3315)(
       STRING_BEGIN(3295...3296)("\""),
       STRING_CONTENT(3296...3314)("⁰⁴⁵₀₁₂"),
       STRING_END(3314...3315)("\""),
       "⁰⁴⁵₀₁₂"
     ),
     StringNode(3316...4121)(
       STRING_BEGIN(3316...3317)("\""),
       STRING_CONTENT(3317...4120)(
         "ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็"
       ),
       STRING_END(4120...4121)("\""),
       "ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็"
     ),
     StringNode(4247...4282)(
       STRING_BEGIN(4247...4248)("\""),
       STRING_CONTENT(4248...4281)("田中さんにあげて下さい"),
       STRING_END(4281...4282)("\""),
       "田中さんにあげて下さい"
     ),
     StringNode(4283...4318)(
       STRING_BEGIN(4283...4284)("\""),
       STRING_CONTENT(4284...4317)("パーティーへ行かないか"),
       STRING_END(4317...4318)("\""),
       "パーティーへ行かないか"
     ),
     StringNode(4319...4333)(
       STRING_BEGIN(4319...4320)("\""),
       STRING_CONTENT(4320...4332)("和製漢語"),
       STRING_END(4332...4333)("\""),
       "和製漢語"
     ),
     StringNode(4334...4345)(
       STRING_BEGIN(4334...4335)("\""),
       STRING_CONTENT(4335...4344)("部落格"),
       STRING_END(4344...4345)("\""),
       "部落格"
     ),
     StringNode(4346...4379)(
       STRING_BEGIN(4346...4347)("\""),
       STRING_CONTENT(4347...4378)("사회과학원 어학연구소"),
       STRING_END(4378...4379)("\""),
       "사회과학원 어학연구소"
     ),
     StringNode(4380...4438)(
       STRING_BEGIN(4380...4381)("\""),
       STRING_CONTENT(4381...4437)("찦차를 타고 온 펲시맨과 쑛다리 똠방각하"),
       STRING_END(4437...4438)("\""),
       "찦차를 타고 온 펲시맨과 쑛다리 똠방각하"
     ),
     StringNode(4439...4471)(
       STRING_BEGIN(4439...4440)("\""),
       STRING_CONTENT(4440...4470)("社會科學院語學研究所"),
       STRING_END(4470...4471)("\""),
       "社會科學院語學研究所"
     ),
     StringNode(4472...4489)(
       STRING_BEGIN(4472...4473)("\""),
       STRING_CONTENT(4473...4488)("울란바토르"),
       STRING_END(4488...4489)("\""),
       "울란바토르"
     ),
     StringNode(4490...4520)(
       STRING_BEGIN(4490...4491)("\""),
       STRING_CONTENT(4491...4519)("𠜎𠜱𠝹𠱓𠱸𠲖𠳏"),
       STRING_END(4519...4520)("\""),
       "𠜎𠜱𠝹𠱓𠱸𠲖𠳏"
     ),
     StringNode(4654...4883)(
       STRING_BEGIN(4654...4655)("\""),
       STRING_CONTENT(4655...4882)(
         "𐐜 𐐔𐐇𐐝𐐀𐐡𐐇𐐓 𐐙𐐊𐐡𐐝𐐓/𐐝𐐇𐐗𐐊𐐤𐐔 𐐒𐐋𐐗 𐐒𐐌 𐐜 𐐡𐐀𐐖𐐇𐐤𐐓𐐝 𐐱𐑂 𐑄 𐐔𐐇𐐝𐐀𐐡𐐇𐐓 𐐏𐐆𐐅𐐤𐐆𐐚𐐊𐐡𐐝𐐆𐐓𐐆"
       ),
       STRING_END(4882...4883)("\""),
       "𐐜 𐐔𐐇𐐝𐐀𐐡𐐇𐐓 𐐙𐐊𐐡𐐝𐐓/𐐝𐐇𐐗𐐊𐐤𐐔 𐐒𐐋𐐗 𐐒𐐌 𐐜 𐐡𐐀𐐖𐐇𐐤𐐓𐐝 𐐱𐑂 𐑄 𐐔𐐇𐐝𐐀𐐡𐐇𐐓 𐐏𐐆𐐅𐐤𐐆𐐚𐐊𐐡𐐝𐐆𐐓𐐆"
     ),
     StringNode(5973...6018)(
       STRING_BEGIN(5973...5974)("\""),
       STRING_CONTENT(5974...6017)("表ポあA鷗ŒéＢ逍Üßªąñ丂㐀𠀀"),
       STRING_END(6017...6018)("\""),
       "表ポあA鷗ŒéＢ逍Üßªąñ丂㐀𠀀"
     ),
     StringNode(6187...6191)(
       STRING_BEGIN(6187...6188)("\""),
       STRING_CONTENT(6188...6190)("Ⱥ"),
       STRING_END(6190...6191)("\""),
       "Ⱥ"
     ),
     StringNode(6192...6196)(
       STRING_BEGIN(6192...6193)("\""),
       STRING_CONTENT(6193...6195)("Ⱦ"),
       STRING_END(6195...6196)("\""),
       "Ⱦ"
     ),
     StringNode(6304...6351)(
       STRING_BEGIN(6304...6305)("\""),
       STRING_CONTENT(6305...6350)("ヽ༼ຈل͜ຈ༽ﾉ ヽ༼ຈل͜ຈ༽ﾉ"),
       STRING_END(6350...6351)("\""),
       "ヽ༼ຈل͜ຈ༽ﾉ ヽ༼ຈل͜ຈ༽ﾉ"
     ),
     StringNode(6352...6373)(
       STRING_BEGIN(6352...6353)("\""),
       STRING_CONTENT(6353...6372)("(｡◕ ∀ ◕｡)"),
       STRING_END(6372...6373)("\""),
       "(｡◕ ∀ ◕｡)"
     ),
     StringNode(6374...6394)(
       STRING_BEGIN(6374...6375)("\""),
       STRING_CONTENT(6375...6393)("｀ｨ(´∀｀∩"),
       STRING_END(6393...6394)("\""),
       "｀ｨ(´∀｀∩"
     ),
     StringNode(6395...6408)(
       STRING_BEGIN(6395...6396)("\""),
       STRING_CONTENT(6396...6407)("__ﾛ(,_,*)"),
       STRING_END(6407...6408)("\""),
       "__ﾛ(,_,*)"
     ),
     StringNode(6409...6431)(
       STRING_BEGIN(6409...6410)("\""),
       STRING_CONTENT(6410...6430)("・(￣∀￣)・:*:"),
       STRING_END(6430...6431)("\""),
       "・(￣∀￣)・:*:"
     ),
     StringNode(6432...6478)(
       STRING_BEGIN(6432...6433)("\""),
       STRING_CONTENT(6433...6477)("ﾟ･✿ヾ╲(｡◕‿◕｡)╱✿･ﾟ"),
       STRING_END(6477...6478)("\""),
       "ﾟ･✿ヾ╲(｡◕‿◕｡)╱✿･ﾟ"
     ),
     StringNode(6479...6532)(
       STRING_BEGIN(6479...6480)("\""),
       STRING_CONTENT(6480...6531)(",。・:*:・゜’( ☻ ω ☻ )。・:*:・゜’"),
       STRING_END(6531...6532)("\""),
       ",。・:*:・゜’( ☻ ω ☻ )。・:*:・゜’"
     ),
     StringNode(6533...6566)(
       STRING_BEGIN(6533...6534)("\""),
       STRING_CONTENT(6534...6565)("(╯°□°）╯︵ ┻━┻)"),
       STRING_END(6565...6566)("\""),
       "(╯°□°）╯︵ ┻━┻)"
     ),
     StringNode(6567...6601)(
       STRING_BEGIN(6567...6568)("\""),
       STRING_CONTENT(6568...6600)("(ﾉಥ益ಥ）ﾉ﻿ ┻━┻"),
       STRING_END(6600...6601)("\""),
       "(ﾉಥ益ಥ）ﾉ﻿ ┻━┻"
     ),
     StringNode(6602...6629)(
       STRING_BEGIN(6602...6603)("\""),
       STRING_CONTENT(6603...6628)("┬─┬ノ( º _ ºノ)"),
       STRING_END(6628...6629)("\""),
       "┬─┬ノ( º _ ºノ)"
     ),
     StringNode(6630...6649)(
       STRING_BEGIN(6630...6631)("\""),
       STRING_CONTENT(6631...6648)("( ͡° ͜ʖ ͡°)"),
       STRING_END(6648...6649)("\""),
       "( ͡° ͜ʖ ͡°)"
     ),
     StringNode(6650...6665)(
       STRING_BEGIN(6650...6651)("\""),
       STRING_CONTENT(6651...6664)("¯\\_(ツ)_/¯"),
       STRING_END(6664...6665)("\""),
       "¯_(ツ)_/¯"
     ),
     StringNode(6776...6782)(
       STRING_BEGIN(6776...6777)("\""),
       STRING_CONTENT(6777...6781)("😍"),
       STRING_END(6781...6782)("\""),
       "😍"
     ),
     StringNode(6783...6793)(
       STRING_BEGIN(6783...6784)("\""),
       STRING_CONTENT(6784...6792)("👩🏽"),
       STRING_END(6792...6793)("\""),
       "👩🏽"
     ),
     StringNode(6794...6869)(
       STRING_BEGIN(6794...6795)("\""),
       STRING_CONTENT(6795...6868)("👨‍🦰 👨🏿‍🦰 👨‍🦱 👨🏿‍🦱 🦹🏿‍♂️"),
       STRING_END(6868...6869)("\""),
       "👨‍🦰 👨🏿‍🦰 👨‍🦱 👨🏿‍🦱 🦹🏿‍♂️"
     ),
     StringNode(6870...6911)(
       STRING_BEGIN(6870...6871)("\""),
       STRING_CONTENT(6871...6910)("👾 🙇 💁 🙅 🙆 🙋 🙎 🙍"),
       STRING_END(6910...6911)("\""),
       "👾 🙇 💁 🙅 🙆 🙋 🙎 🙍"
     ),
     StringNode(6912...6933)(
       STRING_BEGIN(6912...6913)("\""),
       STRING_CONTENT(6913...6932)("🐵 🙈 🙉 🙊"),
       STRING_END(6932...6933)("\""),
       "🐵 🙈 🙉 🙊"
     ),
     StringNode(6934...7012)(
       STRING_BEGIN(6934...6935)("\""),
       STRING_CONTENT(6935...7011)("❤️ 💔 💌 💕 💞 💓 💗 💖 💘 💝 💟 💜 💛 💚 💙"),
       STRING_END(7011...7012)("\""),
       "❤️ 💔 💌 💕 💞 💓 💗 💖 💘 💝 💟 💜 💛 💚 💙"
     ),
     StringNode(7013...7067)(
       STRING_BEGIN(7013...7014)("\""),
       STRING_CONTENT(7014...7066)("✋🏿 💪🏿 👐🏿 🙌🏿 👏🏿 🙏🏿"),
       STRING_END(7066...7067)("\""),
       "✋🏿 💪🏿 👐🏿 🙌🏿 👏🏿 🙏🏿"
     ),
     StringNode(7068...7214)(
       STRING_BEGIN(7068...7069)("\""),
       STRING_CONTENT(7069...7213)(
         "👨‍👩‍👦 👨‍👩‍👧‍👦 👨‍👨‍👦 👩‍👩‍👧 👨‍👦 👨‍👧‍👦 👩‍👦 👩‍👧‍👦"
       ),
       STRING_END(7213...7214)("\""),
       "👨‍👩‍👦 👨‍👩‍👧‍👦 👨‍👨‍👦 👩‍👩‍👧 👨‍👦 👨‍👧‍👦 👩‍👦 👩‍👧‍👦"
     ),
     StringNode(7215...7256)(
       STRING_BEGIN(7215...7216)("\""),
       STRING_CONTENT(7216...7255)("🚾 🆒 🆓 🆕 🆖 🆗 🆙 🏧"),
       STRING_END(7255...7256)("\""),
       "🚾 🆒 🆓 🆕 🆖 🆗 🆙 🏧"
     ),
     StringNode(7257...7343)(
       STRING_BEGIN(7257...7258)("\""),
       STRING_CONTENT(7258...7342)(
         "0️⃣ 1️⃣ 2️⃣ 3️⃣ 4️⃣ 5️⃣ 6️⃣ 7️⃣ 8️⃣ 9️⃣ 🔟"
       ),
       STRING_END(7342...7343)("\""),
       "0️⃣ 1️⃣ 2️⃣ 3️⃣ 4️⃣ 5️⃣ 6️⃣ 7️⃣ 8️⃣ 9️⃣ 🔟"
     ),
     StringNode(7508...7551)(
       STRING_BEGIN(7508...7509)("\""),
       STRING_CONTENT(7509...7550)("🇺🇸🇷🇺🇸 🇦🇫🇦🇲🇸"),
       STRING_END(7550...7551)("\""),
       "🇺🇸🇷🇺🇸 🇦🇫🇦🇲🇸"
     ),
     StringNode(7552...7590)(
       STRING_BEGIN(7552...7553)("\""),
       STRING_CONTENT(7553...7589)("🇺🇸🇷🇺🇸🇦🇫🇦🇲"),
       STRING_END(7589...7590)("\""),
       "🇺🇸🇷🇺🇸🇦🇫🇦🇲"
     ),
     StringNode(7591...7617)(
       STRING_BEGIN(7591...7592)("\""),
       STRING_CONTENT(7592...7616)("🇺🇸🇷🇺🇸🇦"),
       STRING_END(7616...7617)("\""),
       "🇺🇸🇷🇺🇸🇦"
     ),
     StringNode(7742...7753)(
       STRING_BEGIN(7742...7743)("\""),
       STRING_CONTENT(7743...7752)("１２３"),
       STRING_END(7752...7753)("\""),
       "１２３"
     ),
     StringNode(7754...7762)(
       STRING_BEGIN(7754...7755)("\""),
       STRING_CONTENT(7755...7761)("١٢٣"),
       STRING_END(7761...7762)("\""),
       "١٢٣"
     ),
     InterpolatedStringNode(7888...8652)(
       HEREDOC_START(7882...7887)("<<RTL"),
       [StringNode(7888...8652)(
          nil,
          STRING_CONTENT(7888...8652)(
            "ثم نفس سقطت وبالتحديد،, جزيرتي باستخدام أن دنو. إذ هنا؟ الستار وتنصيب كان. أهّل ايطاليا، بريطانيا-فرنسا قد أخذ. سليمان، إتفاقية بين ما, يذكر الحدود أي بعد, معاملة بولندا، الإطلاق عل إيو.\n" +
            "בְּרֵאשִׁית, בָּרָא אֱלֹהִים, אֵת הַשָּׁמַיִם, וְאֵת הָאָרֶץ\n" +
            "הָיְתָהtestالصفحات التّحول\n" +
            "﷽\n" +
            "ﷺ\n" +
            "مُنَاقَشَةُ سُبُلِ اِسْتِخْدَامِ اللُّغَةِ فِي النُّظُمِ الْقَائِمَةِ وَفِيم يَخُصَّ التَّطْبِيقَاتُ الْحاسُوبِيَّةُ،\n" +
            "الكل في المجمو عة (5)\n"
          ),
          nil,
          "ثم نفس سقطت وبالتحديد،, جزيرتي باستخدام أن دنو. إذ هنا؟ الستار وتنصيب كان. أهّل ايطاليا، بريطانيا-فرنسا قد أخذ. سليمان، إتفاقية بين ما, يذكر الحدود أي بعد, معاملة بولندا، الإطلاق عل إيو.\n" +
          "בְּרֵאשִׁית, בָּרָא אֱלֹהִים, אֵת הַשָּׁמַיִם, וְאֵת הָאָרֶץ\n" +
          "הָיְתָהtestالصفحات التّحول\n" +
          "﷽\n" +
          "ﷺ\n" +
          "مُنَاقَشَةُ سُبُلِ اِسْتِخْدَامِ اللُّغَةِ فِي النُّظُمِ الْقَائِمَةِ وَفِيم يَخُصَّ التَّطْبِيقَاتُ الْحاسُوبِيَّةُ،\n" +
          "الكل في المجمو عة (5)\n"
        )],
       HEREDOC_END(8652...8656)("RTL\n")
     ),
     InterpolatedStringNode(8777...8881)(
       HEREDOC_START(8769...8776)("<<OGHAM"),
       [StringNode(8777...8881)(
          nil,
          STRING_CONTENT(8777...8881)(
            "᚛ᚄᚓᚐᚋᚒᚄ ᚑᚄᚂᚑᚏᚅ᚜\n" + "᚛                 ᚜\n"
          ),
          nil,
          "᚛ᚄᚓᚐᚋᚒᚄ ᚑᚄᚂᚑᚏᚅ᚜\n" + "᚛                 ᚜\n"
        )],
       HEREDOC_END(8881...8887)("OGHAM\n")
     ),
     InterpolatedStringNode(9052...9114)(
       HEREDOC_START(9043...9051)("<<TRICKY"),
       [StringNode(9052...9114)(
          nil,
          STRING_CONTENT(9052...9114)(
            "‪‪test‪\n" +
            "‫test‫\n" +
            "\u2029test\u2029\n" +
            "test⁠test‫\n" +
            "⁦test⁧\n"
          ),
          nil,
          "‪‪test‪\n" +
          "‫test‫\n" +
          "\u2029test\u2029\n" +
          "test⁠test‫\n" +
          "⁦test⁧\n"
        )],
       HEREDOC_END(9114...9121)("TRICKY\n")
     ),
     InterpolatedStringNode(9271...10635)(
       HEREDOC_START(9263...9270)("<<ZALGO"),
       [StringNode(9271...10635)(
          nil,
          STRING_CONTENT(9271...10635)(
            "Ṱ̺̺̕o͞ ̷i̲̬͇̪͙n̝̗͕v̟̜̘̦͟o̶̙̰̠kè͚̮̺̪̹̱̤ ̖t̝͕̳̣̻̪͞h̼͓̲̦̳̘̲e͇̣̰̦̬͎ ̢̼̻̱̘h͚͎͙̜̣̲ͅi̦̲̣̰̤v̻͍e̺̭̳̪̰-m̢iͅn̖̺̞̲̯̰d̵̼̟͙̩̼̘̳ ̞̥̱̳̭r̛̗̘e͙p͠r̼̞̻̭̗e̺̠̣͟s̘͇̳͍̝͉e͉̥̯̞̲͚̬͜ǹ̬͎͎̟̖͇̤t͍̬̤͓̼̭͘ͅi̪̱n͠g̴͉ ͏͉ͅc̬̟h͡a̫̻̯͘o̫̟̖͍̙̝͉s̗̦̲.̨̹͈̣\n" +
            "̡͓̞ͅI̗̘̦͝n͇͇͙v̮̫ok̲̫̙͈i̖͙̭̹̠̞n̡̻̮̣̺g̲͈͙̭͙̬͎ ̰t͔̦h̞̲e̢̤ ͍̬̲͖f̴̘͕̣è͖ẹ̥̩l͖͔͚i͓͚̦͠n͖͍̗͓̳̮g͍ ̨o͚̪͡f̘̣̬ ̖̘͖̟͙̮c҉͔̫͖͓͇͖ͅh̵̤̣͚͔á̗̼͕ͅo̼̣̥s̱͈̺̖̦̻͢.̛̖̞̠̫̰\n" +
            "̗̺͖̹̯͓Ṯ̤͍̥͇͈h̲́e͏͓̼̗̙̼̣͔ ͇̜̱̠͓͍ͅN͕͠e̗̱z̘̝̜̺͙p̤̺̹͍̯͚e̠̻̠͜r̨̤͍̺̖͔̖̖d̠̟̭̬̝͟i̦͖̩͓͔̤a̠̗̬͉̙n͚͜ ̻̞̰͚ͅh̵͉i̳̞v̢͇ḙ͎͟-҉̭̩̼͔m̤̭̫i͕͇̝̦n̗͙ḍ̟ ̯̲͕͞ǫ̟̯̰̲͙̻̝f ̪̰̰̗̖̭̘͘c̦͍̲̞͍̩̙ḥ͚a̮͎̟̙͜ơ̩̹͎s̤.̝̝ ҉Z̡̖̜͖̰̣͉̜a͖̰͙̬͡l̲̫̳͍̩g̡̟̼̱͚̞̬ͅo̗͜.̟\n" +
            "̦H̬̤̗̤͝e͜ ̜̥̝̻͍̟́w̕h̖̯͓o̝͙̖͎̱̮ ҉̺̙̞̟͈W̷̼̭a̺̪͍į͈͕̭͙̯̜t̶̼̮s̘͙͖̕ ̠̫̠B̻͍͙͉̳ͅe̵h̵̬͇̫͙i̹͓̳̳̮͎̫̕n͟d̴̪̜̖ ̰͉̩͇͙̲͞ͅT͖̼͓̪͢h͏͓̮̻e̬̝̟ͅ ̤̹̝W͙̞̝͔͇͝ͅa͏͓͔̹̼̣l̴͔̰̤̟͔ḽ̫.͕\n" +
            "Z̮̞̠͙͔ͅḀ̗̞͈̻̗Ḷ͙͎̯̹̞͓G̻O̭̗̮\n"
          ),
          nil,
          "Ṱ̺̺̕o͞ ̷i̲̬͇̪͙n̝̗͕v̟̜̘̦͟o̶̙̰̠kè͚̮̺̪̹̱̤ ̖t̝͕̳̣̻̪͞h̼͓̲̦̳̘̲e͇̣̰̦̬͎ ̢̼̻̱̘h͚͎͙̜̣̲ͅi̦̲̣̰̤v̻͍e̺̭̳̪̰-m̢iͅn̖̺̞̲̯̰d̵̼̟͙̩̼̘̳ ̞̥̱̳̭r̛̗̘e͙p͠r̼̞̻̭̗e̺̠̣͟s̘͇̳͍̝͉e͉̥̯̞̲͚̬͜ǹ̬͎͎̟̖͇̤t͍̬̤͓̼̭͘ͅi̪̱n͠g̴͉ ͏͉ͅc̬̟h͡a̫̻̯͘o̫̟̖͍̙̝͉s̗̦̲.̨̹͈̣\n" +
          "̡͓̞ͅI̗̘̦͝n͇͇͙v̮̫ok̲̫̙͈i̖͙̭̹̠̞n̡̻̮̣̺g̲͈͙̭͙̬͎ ̰t͔̦h̞̲e̢̤ ͍̬̲͖f̴̘͕̣è͖ẹ̥̩l͖͔͚i͓͚̦͠n͖͍̗͓̳̮g͍ ̨o͚̪͡f̘̣̬ ̖̘͖̟͙̮c҉͔̫͖͓͇͖ͅh̵̤̣͚͔á̗̼͕ͅo̼̣̥s̱͈̺̖̦̻͢.̛̖̞̠̫̰\n" +
          "̗̺͖̹̯͓Ṯ̤͍̥͇͈h̲́e͏͓̼̗̙̼̣͔ ͇̜̱̠͓͍ͅN͕͠e̗̱z̘̝̜̺͙p̤̺̹͍̯͚e̠̻̠͜r̨̤͍̺̖͔̖̖d̠̟̭̬̝͟i̦͖̩͓͔̤a̠̗̬͉̙n͚͜ ̻̞̰͚ͅh̵͉i̳̞v̢͇ḙ͎͟-҉̭̩̼͔m̤̭̫i͕͇̝̦n̗͙ḍ̟ ̯̲͕͞ǫ̟̯̰̲͙̻̝f ̪̰̰̗̖̭̘͘c̦͍̲̞͍̩̙ḥ͚a̮͎̟̙͜ơ̩̹͎s̤.̝̝ ҉Z̡̖̜͖̰̣͉̜a͖̰͙̬͡l̲̫̳͍̩g̡̟̼̱͚̞̬ͅo̗͜.̟\n" +
          "̦H̬̤̗̤͝e͜ ̜̥̝̻͍̟́w̕h̖̯͓o̝͙̖͎̱̮ ҉̺̙̞̟͈W̷̼̭a̺̪͍į͈͕̭͙̯̜t̶̼̮s̘͙͖̕ ̠̫̠B̻͍͙͉̳ͅe̵h̵̬͇̫͙i̹͓̳̳̮͎̫̕n͟d̴̪̜̖ ̰͉̩͇͙̲͞ͅT͖̼͓̪͢h͏͓̮̻e̬̝̟ͅ ̤̹̝W͙̞̝͔͇͝ͅa͏͓͔̹̼̣l̴͔̰̤̟͔ḽ̫.͕\n" +
          "Z̮̞̠͙͔ͅḀ̗̞͈̻̗Ḷ͙͎̯̹̞͓G̻O̭̗̮\n"
        )],
       HEREDOC_END(10635...10641)("ZALGO\n")
     ),
     InterpolatedStringNode(10774...10976)(
       HEREDOC_START(10761...10773)("<<UPSIDEDOWN"),
       [StringNode(10774...10976)(
          nil,
          STRING_CONTENT(10774...10976)(
            "˙ɐnbᴉlɐ ɐuƃɐɯ ǝɹolop ʇǝ ǝɹoqɐl ʇn ʇunpᴉpᴉɔuᴉ ɹodɯǝʇ poɯsnᴉǝ op pǝs 'ʇᴉlǝ ƃuᴉɔsᴉdᴉpɐ ɹnʇǝʇɔǝsuoɔ 'ʇǝɯɐ ʇᴉs ɹolop ɯnsdᴉ ɯǝɹo˥\n" +
            "00˙Ɩ$-\n"
          ),
          nil,
          "˙ɐnbᴉlɐ ɐuƃɐɯ ǝɹolop ʇǝ ǝɹoqɐl ʇn ʇunpᴉpᴉɔuᴉ ɹodɯǝʇ poɯsnᴉǝ op pǝs 'ʇᴉlǝ ƃuᴉɔsᴉdᴉpɐ ɹnʇǝʇɔǝsuoɔ 'ʇǝɯɐ ʇᴉs ɹolop ɯnsdᴉ ɯǝɹo˥\n" +
          "00˙Ɩ$-\n"
        )],
       HEREDOC_END(10976...10987)("UPSIDEDOWN\n")
     ),
     InterpolatedStringNode(11085...12207)(
       HEREDOC_START(11077...11084)("<<FONTS"),
       [StringNode(11085...12207)(
          nil,
          STRING_CONTENT(11085...12207)(
            "Ｔｈｅ ｑｕｉｃｋ ｂｒｏｗｎ ｆｏｘ ｊｕｍｐｓ ｏｖｅｒ ｔｈｅ ｌａｚｙ ｄｏｇ\n" +
            "𝐓𝐡𝐞 𝐪𝐮𝐢𝐜𝐤 𝐛𝐫𝐨𝐰𝐧 𝐟𝐨𝐱 𝐣𝐮𝐦𝐩𝐬 𝐨𝐯𝐞𝐫 𝐭𝐡𝐞 𝐥𝐚𝐳𝐲 𝐝𝐨𝐠\n" +
            "𝕿𝖍𝖊 𝖖𝖚𝖎𝖈𝖐 𝖇𝖗𝖔𝖜𝖓 𝖋𝖔𝖝 𝖏𝖚𝖒𝖕𝖘 𝖔𝖛𝖊𝖗 𝖙𝖍𝖊 𝖑𝖆𝖟𝖞 𝖉𝖔𝖌\n" +
            "𝑻𝒉𝒆 𝒒𝒖𝒊𝒄𝒌 𝒃𝒓𝒐𝒘𝒏 𝒇𝒐𝒙 𝒋𝒖𝒎𝒑𝒔 𝒐𝒗𝒆𝒓 𝒕𝒉𝒆 𝒍𝒂𝒛𝒚 𝒅𝒐𝒈\n" +
            "𝓣𝓱𝓮 𝓺𝓾𝓲𝓬𝓴 𝓫𝓻𝓸𝔀𝓷 𝓯𝓸𝔁 𝓳𝓾𝓶𝓹𝓼 𝓸𝓿𝓮𝓻 𝓽𝓱𝓮 𝓵𝓪𝔃𝔂 𝓭𝓸𝓰\n" +
            "𝕋𝕙𝕖 𝕢𝕦𝕚𝕔𝕜 𝕓𝕣𝕠𝕨𝕟 𝕗𝕠𝕩 𝕛𝕦𝕞𝕡𝕤 𝕠𝕧𝕖𝕣 𝕥𝕙𝕖 𝕝𝕒𝕫𝕪 𝕕𝕠𝕘\n" +
            "𝚃𝚑𝚎 𝚚𝚞𝚒𝚌𝚔 𝚋𝚛𝚘𝚠𝚗 𝚏𝚘𝚡 𝚓𝚞𝚖𝚙𝚜 𝚘𝚟𝚎𝚛 𝚝𝚑𝚎 𝚕𝚊𝚣𝚢 𝚍𝚘𝚐\n" +
            "⒯⒣⒠ ⒬⒰⒤⒞⒦ ⒝⒭⒪⒲⒩ ⒡⒪⒳ ⒥⒰⒨⒫⒮ ⒪⒱⒠⒭ ⒯⒣⒠ ⒧⒜⒵⒴ ⒟⒪⒢\n"
          ),
          nil,
          "Ｔｈｅ ｑｕｉｃｋ ｂｒｏｗｎ ｆｏｘ ｊｕｍｐｓ ｏｖｅｒ ｔｈｅ ｌａｚｙ ｄｏｇ\n" +
          "𝐓𝐡𝐞 𝐪𝐮𝐢𝐜𝐤 𝐛𝐫𝐨𝐰𝐧 𝐟𝐨𝐱 𝐣𝐮𝐦𝐩𝐬 𝐨𝐯𝐞𝐫 𝐭𝐡𝐞 𝐥𝐚𝐳𝐲 𝐝𝐨𝐠\n" +
          "𝕿𝖍𝖊 𝖖𝖚𝖎𝖈𝖐 𝖇𝖗𝖔𝖜𝖓 𝖋𝖔𝖝 𝖏𝖚𝖒𝖕𝖘 𝖔𝖛𝖊𝖗 𝖙𝖍𝖊 𝖑𝖆𝖟𝖞 𝖉𝖔𝖌\n" +
          "𝑻𝒉𝒆 𝒒𝒖𝒊𝒄𝒌 𝒃𝒓𝒐𝒘𝒏 𝒇𝒐𝒙 𝒋𝒖𝒎𝒑𝒔 𝒐𝒗𝒆𝒓 𝒕𝒉𝒆 𝒍𝒂𝒛𝒚 𝒅𝒐𝒈\n" +
          "𝓣𝓱𝓮 𝓺𝓾𝓲𝓬𝓴 𝓫𝓻𝓸𝔀𝓷 𝓯𝓸𝔁 𝓳𝓾𝓶𝓹𝓼 𝓸𝓿𝓮𝓻 𝓽𝓱𝓮 𝓵𝓪𝔃𝔂 𝓭𝓸𝓰\n" +
          "𝕋𝕙𝕖 𝕢𝕦𝕚𝕔𝕜 𝕓𝕣𝕠𝕨𝕟 𝕗𝕠𝕩 𝕛𝕦𝕞𝕡𝕤 𝕠𝕧𝕖𝕣 𝕥𝕙𝕖 𝕝𝕒𝕫𝕪 𝕕𝕠𝕘\n" +
          "𝚃𝚑𝚎 𝚚𝚞𝚒𝚌𝚔 𝚋𝚛𝚘𝚠𝚗 𝚏𝚘𝚡 𝚓𝚞𝚖𝚙𝚜 𝚘𝚟𝚎𝚛 𝚝𝚑𝚎 𝚕𝚊𝚣𝚢 𝚍𝚘𝚐\n" +
          "⒯⒣⒠ ⒬⒰⒤⒞⒦ ⒝⒭⒪⒲⒩ ⒡⒪⒳ ⒥⒰⒨⒫⒮ ⒪⒱⒠⒭ ⒯⒣⒠ ⒧⒜⒵⒴ ⒟⒪⒢\n"
        )],
       HEREDOC_END(12207...12213)("FONTS\n")
     ),
     InterpolatedStringNode(12316...12488)(
       HEREDOC_START(12303...12315)("<<TERMESCAPE"),
       [StringNode(12316...12488)(
          nil,
          STRING_CONTENT(12316...12488)(
            "Roses are \e[0;31mred\e[0m, violets are \e[0;34mblue. Hope you enjoy terminal hue\n" +
            "But now...\e[20Cfor my greatest trick...\e[8m\n" +
            "The quic\b\b\b\b\b\bk brown fo\a\a\a\a\a\a\a\a\a\a\ax... [Beeeep]\n"
          ),
          nil,
          "Roses are \e[0;31mred\e[0m, violets are \e[0;34mblue. Hope you enjoy terminal hue\n" +
          "But now...\e[20Cfor my greatest trick...\e[8m\n" +
          "The quic\b\b\b\b\b\bk brown fo\a\a\a\a\a\a\a\a\a\a\ax... [Beeeep]\n"
        )],
       HEREDOC_END(12488...12499)("TERMESCAPE\n")
     ),
     InterpolatedStringNode(12594...12685)(
       HEREDOC_START(12585...12593)("<<IOSVUL"),
       [StringNode(12594...12685)(
          nil,
          STRING_CONTENT(12594...12685)(
            "Powerلُلُصّبُلُلصّبُررً ॣ ॣh ॣ ॣ冗\n" + "🏳0🌈️\n" + "జ్ఞ‌ా\n"
          ),
          nil,
          "Powerلُلُصّبُلُلصّبُررً ॣ ॣh ॣ ॣ冗\n" + "🏳0🌈️\n" + "జ్ఞ‌ా\n"
        )],
       HEREDOC_END(12685...12692)("IOSVUL\n")
     ),
     StringNode(12813...12823)(
       STRING_BEGIN(12813...12814)("\""),
       STRING_CONTENT(12814...12822)("گچپژ"),
       STRING_END(12822...12823)("\""),
       "گچپژ"
     )]
  )
)
